In [1]:
import pandas as pd

In [46]:
data = {'names': ['orgs','spaces','apps','services'],
        'last_month':  [100, 525, 200.5668, 465.7712],
        'this_month': [110, 510, 220.4454, 433.3527]
        }

df = pd.DataFrame(data)

df = df.set_index('names')

df['change'] = round((df.this_month - df.last_month)/df.last_month*100, 1)

df

          last_month  this_month  change
names
orgs        100.0000    110.0000    10.0
spaces      525.0000    510.0000    -2.9
apps        200.5668    220.4454     9.9
services    465.7712    433.3527    -7.0

In [50]:
df_top = df.loc[['orgs','spaces']]

df_top[['last_month','this_month']] = df_top[['last_month','this_month']].astype(int)
    
df_top

        last_month  this_month  change
names
orgs           100         110    10.0
spaces         525         510    -2.9

In [52]:
df_bot = df.loc[['apps','services']]

df_bot[['last_month','this_month']] = df_bot[['last_month','this_month']].round(2)

df_bot

          last_month  this_month  change
names
apps          200.57      220.45     9.9
services      465.77      433.35    -7.0

In [53]:
df_concat = pd.concat([df_top.astype(object), df_bot.astype(object)])

df_concat

         last_month this_month change
names
orgs            100        110   10.0
spaces          525        510   -2.9
apps         200.57     220.45    9.9
services     465.77     433.35   -7.0